servers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-05 Tue 10:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>biobuntu server file system</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas Alexander Gerds Thomas A. Gerds" />
<link rel="stylesheet" type="text/css" href="https://publicifsv.sund.ku.dk/~tag/styles/practicals.css" />
</head>
<body>
<p class="course-menu"><a accesskey="h" href="README.html">Home</a>&nbsp;<a accesskey="p" href="https://github.com/tagteam">github</a></p><div id="preamble" class="status">
<br>Thomas Alexander Gerds Thomas A. Gerds
</div>
<div id="content">
<h1 class="title">biobuntu server file system</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org55bf7e0">Background</a>
<ul>
<li><a href="#org7fe14c0">Linux home</a></li>
<li><a href="#orgfbeb42c">Windows file system</a></li>
<li><a href="#org4a3c451">Fast Linux file system</a></li>
</ul>
</li>
<li><a href="#orgcddc3f3">Copy all files from the window drive to the linux drive</a></li>
<li><a href="#org9665f05">Synchronize files</a>
<ul>
<li><a href="#orgcf048a0">Remotely: Unison</a></li>
<li><a href="#orgd5151d3">Locally: Unison</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
In all of the following <code>*Terminal*</code> codes you should replace <code>bio737</code>
with your own <b>KU-id</b>. Shout out loud (we need to be able to hear you
in bygning 15) if you run into unclearness, typos or really unsolvable
problems &#x2026;
</p>

<div id="outline-container-org55bf7e0" class="outline-2">
<h2 id="org55bf7e0">Background</h2>
<div class="outline-text-2" id="text-org55bf7e0">
<p>
Here we explain how to deal with the situation after the
great consolidation in fall 2021.
</p>

<p>
Our linux servers are used to:
</p>
<ol class="org-ol">
<li>run simulations and data analyses that require multiple cores or a lot of memory.</li>
<li>to back up our work, i.e., to synchronize the files that you have on your bring-your-own-device with the KU file system.</li>
</ol>
</div>

<div id="outline-container-org7fe14c0" class="outline-3">
<h3 id="org7fe14c0">Linux home</h3>
<div class="outline-text-3" id="text-org7fe14c0">
<p>
When you login to one of our linux servers, e.g., doob (see
<a href="./connect">./connect</a>), you are in your home folder which is
</p>

<div class="org-src-container">
<pre class="src src-sh">/home/bio737
</pre>
</div>

<p>
In this place you are not allowed to have more than 10 Gb.
</p>
</div>
</div>

<div id="outline-container-orgfbeb42c" class="outline-3">
<h3 id="orgfbeb42c">Windows file system</h3>
<div class="outline-text-3" id="text-orgfbeb42c">
<p>
You have a subdirectory called <code>ucph</code> where KU-IT has mounted
their windows file server with all your files in a subdirectory called
<code>hdir</code>. The mount may first happen when you change directory:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> /home/bio737/ucph/hdir
</pre>
</div>

<p>
In here your files are in another subdirectory:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">cd</span> /home/bio737/ucph/hdir/SundKonsolidering_biostat/
</pre>
</div>

<p>
In fact you can move all folders and files out of this subdirectory and then
remove it:
</p>

<div class="org-src-container">
<pre class="src src-sh">mv /home/bio737/ucph/hdir/SundKonsolidering_biostat/* /home/bio737/ucph/hdir/
rm -r /home/bio737/ucph/hdir/SundKonsolidering_biostat
</pre>
</div>
</div>
</div>

<div id="outline-container-org4a3c451" class="outline-3">
<h3 id="org4a3c451">Fast Linux file system</h3>
<div class="outline-text-3" id="text-org4a3c451">
<p>
There is also a fast harddisk that you can access under
</p>

<div class="org-src-container">
<pre class="src src-sh">/projects/biostat01/people/bio737/
</pre>
</div>

<p>
You should synchronize your bring-your-own-device files with this fast
linux drive. See instructions below.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcddc3f3" class="outline-2">
<h2 id="orgcddc3f3">Copy all files from the window drive to the linux drive</h2>
<div class="outline-text-2" id="text-orgcddc3f3">
<p>
In a terminal log-in to <code>doob</code> or <code>rasch</code> via ssh. There you copy all
your files
</p>

<div class="org-src-container">
<pre class="src src-sh">cp -r /home/bio737/ucph/hdir/* /projects/biostat01/people/bio737/
</pre>
</div>

<p>
If this take a long time you can run this in the background such that
it continuous to after you have logged out:
</p>

<div class="org-src-container">
<pre class="src src-sh">nohub cp -r /home/bio737/ucph/hdir/* /projects/biostat01/people/bio737/
</pre>
</div>
</div>
</div>

<div id="outline-container-org9665f05" class="outline-2">
<h2 id="org9665f05">Synchronize files</h2>
<div class="outline-text-2" id="text-org9665f05">
<p>
There are two possibilities:
</p>

<ol class="org-ol">
<li>Remotely: run unison to synchronize your files with the linux drive on the server</li>
<li>Locally: first mount the linux drive and then run unison locally</li>
</ol>
</div>

<div id="outline-container-orgcf048a0" class="outline-3">
<h3 id="orgcf048a0">Remotely: Unison</h3>
<div class="outline-text-3" id="text-orgcf048a0">
<p>
Here is an example <code>.prf</code> file:
</p>

<pre class="example" id="orgacbff9e">
root = /home/user-name-on-bring-your-own-device/
root = ssh://bio737@doob//home/ifsv/bio737/

# allow that new directories are created  
watch = false

path = .bashrc
path = research
path = projects

ignore = Name *.exe
ignore = Name *.~
ignore = Name *.o
</pre>
</div>
</div>


<div id="outline-container-orgd5151d3" class="outline-3">
<h3 id="orgd5151d3">Locally: Unison</h3>
<div class="outline-text-3" id="text-orgd5151d3">
<p>
First, to mount the file system into your bring-your-own-device create
a directory in your bring-your-own-device, e.g., a directory called
<code>doob</code> (you have to this only once!):
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir ~/doob
</pre>
</div>

<p>
Mount the fast linux drive (you have to do this every time):
</p>

<div class="org-src-container">
<pre class="src src-sh">sshfs bio737@biostatcomp03fl:/projects/biostat01/people/bio737 ~/doob
</pre>
</div>

<p>
Here is an example <code>.prf</code> file:
</p>

<pre class="example" id="orgfca4180">
root = /home/user-name-on-bring-your-own-device/
root = /home/user-name-on-bring-your-own-device/doob

# allow that new directories are created  
watch = false

path = .bashrc
path = research
path = projects

ignore = Name *.exe
ignore = Name *.~
ignore = Name *.o
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 05 Oct 2021 by Thomas Alexander Gerds.
</div>
</body>
</html>
